Pandas

Pandas is a data manipulation library used for data analysis and data cleaning. It provdies two primary data structures... series and dataframe. A series is a one-dimensional array like object, while dataframe is a two dimensional , size mutable and potentially heterogenous tabular data structure with labeled axes (rows and columns)

In [1]:
import pandas as pd

Series

In [3]:
data = [1,2,3,4,5]
series= pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# create a series from dictionary
data = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(data)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
data = [10,20,30]
index = ['a', 'b', 'c']
series_with_index = pd.Series(data, index=index)
print(series_with_index)

a    10
b    20
c    30
dtype: int64

Dataframe

In [29]:
# create a DataFrame from a dictionary of lists
data0={
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df0=pd.DataFrame(data0)
print(df0)
print(type(df0))

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>

In [10]:
import numpy as np
np.array(df)

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Los Angeles'],
       ['Charlie', 35, 'Chicago']], dtype=object)

In [25]:
# create a DataFrame from a list of dictionaries
data1 = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}   
]

In [27]:
df1 = pd.DataFrame(data1)
print(df1)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [18]:
df = pd.read_csv('sales_data.csv')
df.head()
# df.head(10) # first 10 rows

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [17]:
df.tail()
# last 5 rows

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [30]:
data0['Name']

['Alice', 'Bob', 'Charlie']

In [33]:
df.loc[0]
 # first row

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [ ]:
df.iloc[0]
# first row
# index location

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [37]:
df.iloc[0][0]

C:\Users\Rajeev Pandey\AppData\Local\Temp\ipykernel_8544\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Alice'

In [ ]:
df.at[1,'Age']
# get the value of the cell at row 1 and column 'Age'

30

In [39]:
# acessing specific elements using iat
df.iat[1, 2]

'Los Angeles'

Data Manipulation

In [44]:
# let us add a new column to the DataFrame (salary)
df['Salary'] = [50000, 60000, 70000]
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:
# remove a column
df.drop('Salary', axis=1, inplace=True)
print(df)
# axis=1 means column
# axis=0 means row
# inplace=True means modify the original DataFrame

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
# add age to the column
df['Age']=df['Age']+1
print(df)
# bascially incrementing the age by 1 next year

      Name  Age         City
0    Alice   26     New York
1      Bob   31  Los Angeles
2  Charlie   36      Chicago

In [47]:
df.drop(0)

      Name  Age         City
1      Bob   31  Los Angeles
2  Charlie   36      Chicago

In [ ]:
df
# so operation wasnt permanent

      Name  Age         City
0    Alice   26     New York
1      Bob   31  Los Angeles
2  Charlie   36      Chicago

In [49]:
df.drop(0, inplace=True)
print(df)

      Name  Age         City
1      Bob   31  Los Angeles
2  Charlie   36      Chicago